# WSScript_AddHandle

## Description
Add a handle for a worksheet script usage. This is most notable used for scripts that generate object database for worksheets.

```pascal
PROCEDURE WSScript_AddHandle(h : HANDLE);
```

```python

def vs.WSScript_AddHandle(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|The handle of an object to be added|

## Version
Availability: from Vectorworks 2020
## Category
* Worksheets